Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [ ]:
import pandas as pd

In [ ]:
#Import python Libraries
import numpy as np
import pandas as pd
import matplotlib as mpl
import seaborn as sns

In [ ]:
df = pd.read_csv("/content/Salaries.csv",index_col=0)

In [ ]:
df.head()

     discipline  phd  service   sex  salary
rank
Prof          B   56       49  Male  186960
Prof          A   12        6  Male   93000
Prof          A   23       20  Male  110515
Prof          A   40       31  Male  131205
Prof          B   20       18  Male  104800

In [ ]:
df.head(10)

          discipline  phd  service   sex  salary
rank
Prof               B   56       49  Male  186960
Prof               A   12        6  Male   93000
Prof               A   23       20  Male  110515
Prof               A   40       31  Male  131205
Prof               B   20       18  Male  104800
Prof               A   20       20  Male  122400
AssocProf          A   20       17  Male   81285
Prof               A   18       18  Male  126300
Prof               A   29       19  Male   94350
Prof               A   51       51  Male   57800

In [ ]:
df.dtypes

discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [ ]:
df.columns

Index(['discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [ ]:
df.size

390

In [ ]:
df.shape

(78, 5)

In [ ]:
df.ndim

2

In [ ]:
df.values

array([['B', 56, 49, 'Male', 186960],
       ['A', 12, 6, 'Male', 93000],
       ['A', 23, 20, 'Male', 110515],
       ['A', 40, 31, 'Male', 131205],
       ['B', 20, 18, 'Male', 104800],
       ['A', 20, 20, 'Male', 122400],
       ['A', 20, 17, 'Male', 81285],
       ['A', 18, 18, 'Male', 126300],
       ['A', 29, 19, 'Male', 94350],
       ['A', 51, 51, 'Male', 57800],
       ['B', 39, 33, 'Male', 128250],
       ['B', 23, 23, 'Male', 134778],
       ['B', 1, 0, 'Male', 88000],
       ['B', 35, 33, 'Male', 162200],
       ['B', 25, 19, 'Male', 153750],
       ['B', 17, 3, 'Male', 150480],
       ['B', 8, 3, 'Male', 75044],
       ['B', 4, 0, 'Male', 92000],
       ['A', 19, 7, 'Male', 107300],
       ['A', 29, 27, 'Male', 150500],
       ['B', 4, 4, 'Male', 92000],
       ['A', 33, 30, 'Male', 103106],
       ['A', 4, 2, 'Male', 73000],
       ['A', 2, 0, 'Male', 85000],
       ['A', 30, 23, 'Male', 91100],
       ['B', 35, 31, 'Male', 99418],
       ['A', 38, 19, 'Male', 148750],
       ['A', 45, 43, 'Male', 155865],
       ['B', 7, 2, 'Male', 91300],
       ['B', 21, 20, 'Male', 123683],
       ['B', 9, 7, 'Male', 107008],
       ['B', 22, 21, 'Male', 155750],
       ['A', 27, 19, 'Male', 103275],
       ['B', 18, 18, 'Male', 120000],
       ['B', 12, 8, 'Male', 119800],
       ['B', 28, 23, 'Male', 126933],
       ['B', 45, 45, 'Male', 146856],
       ['A', 20, 8, 'Male', 102000],
       ['B', 4, 3, 'Male', 91000],
       ['B', 18, 18, 'Female', 129000],
       ['A', 39, 36, 'Female', 137000],
       ['A', 13, 8, 'Female', 74830],
       ['B', 4, 2, 'Female', 80225],
       ['B', 5, 0, 'Female', 77000],
       ['B', 23, 19, 'Female', 151768],
       ['B', 25, 25, 'Female', 140096],
       ['B', 11, 3, 'Female', 74692],
       ['B', 11, 11, 'Female', 103613],
       ['B', 17, 17, 'Female', 111512],
       ['B', 17, 18, 'Female', 122960],
       ['B', 10, 5, 'Female', 97032],
       ['B', 20, 14, 'Female', 127512],
       ['A', 12, 0, 'Female', 105000],
       ['A', 5, 3, 'Female', 73500],
       ['A', 25, 22, 'Female', 62884],
       ['A', 2, 0, 'Female', 72500],
       ['A', 10, 8, 'Female', 77500],
       ['A', 3, 1, 'Female', 72500],
       ['B', 36, 26, 'Female', 144651],
       ['B', 12, 10, 'Female', 103994],
       ['B', 3, 3, 'Female', 92000],
       ['B', 13, 10, 'Female', 103750],
       ['B', 14, 7, 'Female', 109650],
       ['A', 29, 27, 'Female', 91000],
       ['A', 26, 24, 'Female', 73300],
       ['A', 36, 19, 'Female', 117555],
       ['A', 7, 6, 'Female', 63100],
       ['A', 17, 11, 'Female', 90450],
       ['A', 4, 2, 'Female', 77500],
       ['A', 28, 7, 'Female', 116450],
       ['A', 8, 3, 'Female', 78500],
       ['B', 12, 9, 'Female', 71065],
       ['B', 24, 15, 'Female', 161101],
       ['B', 18, 10, 'Female', 105450],
       ['B', 19, 6, 'Female', 104542],
       ['B', 17, 17, 'Female', 124312],
       ['A', 28, 14, 'Female', 109954],
       ['A', 23, 15, 'Female', 109646]], dtype=object)

In [ ]:
df.axes

[Index(['Prof', 'Prof', 'Prof', 'Prof', 'Prof', 'Prof', 'AssocProf', 'Prof',
        'Prof', 'Prof', 'Prof', 'Prof', 'AsstProf', 'Prof', 'Prof', 'Prof',
        'AsstProf', 'AsstProf', 'Prof', 'Prof', 'AsstProf', 'Prof', 'AsstProf',
        'AsstProf', 'Prof', 'Prof', 'Prof', 'Prof', 'AsstProf', 'Prof',
        'AssocProf', 'Prof', 'Prof', 'Prof', 'AssocProf', 'Prof', 'Prof',
        'Prof', 'AsstProf', 'Prof', 'Prof', 'AssocProf', 'AsstProf', 'AsstProf',
        'Prof', 'Prof', 'AsstProf', 'AssocProf', 'Prof', 'Prof', 'AsstProf',
        'Prof', 'Prof', 'AsstProf', 'AssocProf', 'AsstProf', 'AssocProf',
        'AsstProf', 'Prof', 'AssocProf', 'AsstProf', 'AssocProf', 'AssocProf',
        'Prof', 'AssocProf', 'Prof', 'AsstProf', 'Prof', 'AsstProf', 'Prof',
        'AsstProf', 'AssocProf', 'Prof', 'Prof', 'AssocProf', 'Prof', 'Prof',
        'Prof'],
       dtype='object', name='rank'),
 Index(['discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [ ]:
#Find how many records in this data frame has
df.shape[0]

78

In [ ]:
#How many columns are there?
df.shape[1]

5

In [ ]:
#What are the column names?
df.columns

Index(['discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [ ]:
what type of columns we have in this dataframe?
df.dtypes

Object `dataframe` not found.

discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [ ]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [ ]:
df.max()

discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [ ]:
df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [ ]:
#calculate standard deviation for all numeric columns?
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [ ]:
df.std

<bound method DataFrame.std of           discipline  phd  service     sex  salary
rank
Prof               B   56       49    Male  186960
Prof               A   12        6    Male   93000
Prof               A   23       20    Male  110515
Prof               A   40       31    Male  131205
Prof               B   20       18    Male  104800
...              ...  ...      ...     ...     ...
Prof               B   18       10  Female  105450
AssocProf          B   19        6  Female  104542
Prof               B   17       17  Female  124312
Prof               A   28       14  Female  109954
Prof               A   23       15  Female  109646

[78 rows x 5 columns]>

In [ ]:
# What are the mean values of the first 50 records in the dataset?

df_50 = df.head(50)

In [ ]:
df_50.mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [ ]:
df_50

          discipline  phd  service     sex  salary
rank
Prof               B   56       49    Male  186960
Prof               A   12        6    Male   93000
Prof               A   23       20    Male  110515
Prof               A   40       31    Male  131205
Prof               B   20       18    Male  104800
Prof               A   20       20    Male  122400
AssocProf          A   20       17    Male   81285
Prof               A   18       18    Male  126300
Prof               A   29       19    Male   94350
Prof               A   51       51    Male   57800
Prof               B   39       33    Male  128250
Prof               B   23       23    Male  134778
AsstProf           B    1        0    Male   88000
Prof               B   35       33    Male  162200
Prof               B   25       19    Male  153750
Prof               B   17        3    Male  150480
AsstProf           B    8        3    Male   75044
AsstProf           B    4        0    Male   92000
Prof               A   19        7    Male  107300
Prof               A   29       27    Male  150500
AsstProf           B    4        4    Male   92000
Prof               A   33       30    Male  103106
AsstProf           A    4        2    Male   73000
AsstProf           A    2        0    Male   85000
Prof               A   30       23    Male   91100
Prof               B   35       31    Male   99418
Prof               A   38       19    Male  148750
Prof               A   45       43    Male  155865
AsstProf           B    7        2    Male   91300
Prof               B   21       20    Male  123683
AssocProf          B    9        7    Male  107008
Prof               B   22       21    Male  155750
Prof               A   27       19    Male  103275
Prof               B   18       18    Male  120000
AssocProf          B   12        8    Male  119800
Prof               B   28       23    Male  126933
Prof               B   45       45    Male  146856
Prof               A   20        8    Male  102000
AsstProf           B    4        3    Male   91000
Prof               B   18       18  Female  129000
Prof               A   39       36  Female  137000
AssocProf          A   13        8  Female   74830
AsstProf           B    4        2  Female   80225
AsstProf           B    5        0  Female   77000
Prof               B   23       19  Female  151768
Prof               B   25       25  Female  140096
AsstProf           B   11        3  Female   74692
AssocProf          B   11       11  Female  103613
Prof               B   17       17  Female  111512
Prof               B   17       18  Female  122960

In [ ]:
df_50.mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [ ]:
df.head(50).mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [ ]:
#Calculate the basic statistics for the phd column?
df['phd'].describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [ ]:
#Find how many values in the phd column(use count method)
df['phd'].count()

78

In [ ]:
#calculate the average phd?
df['phd'].mean()

19.705128205128204

In [ ]:
df.head()

     discipline  phd  service   sex  salary
rank
Prof          B   56       49  Male  186960
Prof          A   12        6  Male   93000
Prof          A   23       20  Male  110515
Prof          A   40       31  Male  131205
Prof          B   20       18  Male  104800

In [ ]:
df.groupby(['rank']).mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [ ]:
df.groupby('rank')[['phd','salary']].mean()

                 phd         salary
rank
AssocProf  15.076923   91786.230769
AsstProf    5.052632   81362.789474
Prof       27.065217  123624.804348

In [ ]:
df.head()

     discipline  phd  service   sex  salary
rank
Prof          B   56       49  Male  186960
Prof          A   12        6  Male   93000
Prof          A   23       20  Male  110515
Prof          A   40       31  Male  131205
Prof          B   20       18  Male  104800

In [ ]:
df[df['salary']>120000]

     discipline  phd  service     sex  salary
rank
Prof          B   56       49    Male  186960
Prof          A   40       31    Male  131205
Prof          A   20       20    Male  122400
Prof          A   18       18    Male  126300
Prof          B   39       33    Male  128250
Prof          B   23       23    Male  134778
Prof          B   35       33    Male  162200
Prof          B   25       19    Male  153750
Prof          B   17        3    Male  150480
Prof          A   29       27    Male  150500
Prof          A   38       19    Male  148750
Prof          A   45       43    Male  155865
Prof          B   21       20    Male  123683
Prof          B   22       21    Male  155750
Prof          B   28       23    Male  126933
Prof          B   45       45    Male  146856
Prof          B   18       18  Female  129000
Prof          A   39       36  Female  137000
Prof          B   23       19  Female  151768
Prof          B   25       25  Female  140096
Prof          B   17       18  Female  122960
Prof          B   20       14  Female  127512
Prof          B   36       26  Female  144651
Prof          B   24       15  Female  161101
Prof          B   17       17  Female  124312

In [ ]:
#Extract Discipline - B and phd >= 20
df[(df['discipline']=='B') & (df['phd']>=20)]

     discipline  phd  service     sex  salary
rank
Prof          B   56       49    Male  186960
Prof          B   20       18    Male  104800
Prof          B   39       33    Male  128250
Prof          B   23       23    Male  134778
Prof          B   35       33    Male  162200
Prof          B   25       19    Male  153750
Prof          B   35       31    Male   99418
Prof          B   21       20    Male  123683
Prof          B   22       21    Male  155750
Prof          B   28       23    Male  126933
Prof          B   45       45    Male  146856
Prof          B   23       19  Female  151768
Prof          B   25       25  Female  140096
Prof          B   20       14  Female  127512
Prof          B   36       26  Female  144651
Prof          B   24       15  Female  161101

In [ ]:
df.head()

     discipline  phd  service   sex  salary
rank
Prof          B   56       49  Male  186960
Prof          A   12        6  Male   93000
Prof          A   23       20  Male  110515
Prof          A   40       31  Male  131205
Prof          B   20       18  Male  104800

In [ ]:
#top 2 rows and last 2 columns
df.iloc[0:2,4:]

      salary
rank
Prof  186960
Prof   93000

In [ ]:
# 2,3 row and 2,3,4 columns
df.iloc[2:4,2:5]

      service   sex  salary
rank
Prof       20  Male  110515
Prof       31  Male  131205

In [ ]:
#last 3 rows ,first 3 columns
df.iloc[-3:,0:3]

     discipline  phd  service
rank
Prof          B   17       17
Prof          A   28       14
Prof          A   23       15

In [ ]:
# matplotlib

In [81]:
#matplotlib to render plots in the notebook
%matplotlib inline